controllers/MenuController.php

SELECT `aname`, `aid` FROM `we_account`
SELECT * FROM `we_menu` WHERE `mgrade`=0
SELECT * FROM `we_menu` WHERE `mgrade`='19'
---
	public function actionGo()
	{
        $account_data = Account::find() -> select('aname,aid') -> asArray() ->all();
        $result = Menu::find() -> where(['mgrade'=>0]) -> asArray()-> all();
        foreach($result as $k=>$v){
            $result1 = Menu::find() -> where(['mgrade'=>$v['mid']]) -> asArray() -> all();

SELECT * FROM `we_menu` WHERE (`mgrade`=0) AND (`aid`='8')
SELECT * FROM `we_menu` WHERE `mgrade`='19'
SELECT * FROM `we_account` WHERE `aid`='8'
---
    public function actionSheng()
    {
        $aid = \Yii::$app->request->get('aid');
        $result = Menu::find() -> where(['mgrade'=>0]) ->andWhere(['aid'=>$aid]) -> asArray()-> all();
        foreach($result as $k=>$v){
            $result1 = Menu::find() -> where(['mgrade'=>$v['mid']]) -> asArray() -> all();
            $data1[$k]['main'] = $v['mname'];
            $data1[$k]['aid'] = $v['aid'];
            $data1[$k]['brother'] = $result1;
        }
        $result = Account::find() ->andWhere(['aid'=>$aid]) -> asArray()-> one();