controllers/UsersController.php

    public function actionUfo()
    {
        $code = empty($_GET['code']) ? NULL : $_GET['code'] ;
        $state =empty($_GET['state']) ? NULL : $_GET['state'] ;
        $query = Account::find();
        $list = $query->orderBy('aid')->where(['atok'=>$state])->asarray()->one();
---
SELECT * FROM `we_account` WHERE `atok`='YW9FX' ORDER BY `aid`